Tekla.Structures.ConnectionStatusEnum
The status type defines what the status of a connection or a detail is.
In the model the color of the symbol (green, yellow, red) indicates the status.

Tekla.Structures.ConnectionStatusEnum.STATUS_UNKNOWN
The status is unknown.

Tekla.Structures.ConnectionStatusEnum.STATUS_OK
The status is ok and the symbol color is green.

Tekla.Structures.ConnectionStatusEnum.STATUS_WARNING
The status indicates a warning and the symbol color is yellow.

Tekla.Structures.ConnectionStatusEnum.STATUS_ERROR
The status indicates an error and the symbol color is red.